files/app/controllers/users_controller.rb

def create
         @user = User.new(username: params[:username], email: params[:email], password: params[:password])
        # @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-08-01 11:02:51.843261"], ["updated_at", "2018-08-01 11:02:51.843261"]]